print('Калькулятор')
q1 = int(input('Введіть число 1: '))
q2 = int(input('Введіть число 2: '))

v = int(input(
    'Яку операцію бажаєте виконати? \n 1 Додавання \n 2 Віднімання \n 3 Ділення \n 4 Множення \n 5 Піднесення до степеня \n'))

if v == 1:
    r = q1 + q2
    p = 'додавання'
    t = p
if v == 2:
    r = q1 - q2
    l = 'віднімання'
    t = l
if v == 3:
    r = float(q1 / q2)
    m = 'ділення'
    t = m
if v == 4:
    r = q1 * q2
    n = 'множення'
    t = n
if v == 5:
    r = q1 ** q2
    w = 'піднесення до степеню'
    t = w
print('Результат ', t, ' = ', r)
